Revit 2017 API
RevitLinkType Methods
The RevitLinkType type exposes the following members.
Methods
Name | Description
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
Create(Document, ExternalResourceReference, RevitLinkOptions)
 Creates a new Revit link type from an external resource reference and loads the linked document.
Create(Document, ModelPath, RevitLinkOptions)
 Creates a new Revit link type and loads the linked document.
CreateFromIFC
 Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file.
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
Dispose |  (Inherited from Element.)
Duplicate
 Duplicates an existing element type and assigns it a new name.
 (Inherited from ElementType.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetChildIds
 Gets the ids of the immediate children of this link.
GetConversionData
 Returns the optional data that is necessary to generate the Revit file for this link.
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetParentId
 Gets the id of this link's immediate parent.
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPreviewImage
Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element.
 (Inherited from ElementType.)
GetRootId
 Gets the id of the top-level link which this link is linked into.
GetSimilarTypes
 Obtains a set of types that are similar to this type.
 (Inherited from ElementType.)
GetTopLevelLink(Document, ExternalResourceReference)
 Returns the ElementId of the (top-level) linked model with the given ExternalResourceReference.
GetTopLevelLink(Document, ModelPath)
 Returns the ElementId of the (top-level) linked model with the given path.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasSaveablePositions
 Determines whether the link has changes to shared positioning that could be saved.
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsFromLocalPath
 Checks whether the Revit link uses a local path, such as a hard drive.
IsFromRevitServer
 Checks whether the Revit link is located on Revit Server.
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsLoaded
 Checks whether the link with this id is loaded.
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsNotLoadedIntoMultipleOpenDocuments
 Checks whether the link is loaded into more than one open document in this session of Revit. If the link is loaded into multiple open documents, reload will be disabled.
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsSimilarType
 Checks if given type is similar to this type.
 (Inherited from ElementType.)
IsValidDefaultFamilyType
 Identifies if this type is a valid default family type for the given family category id.
 (Inherited from ElementType.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
Load
 Loads or reloads the Revit link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
LoadFrom(ExternalResourceReference, WorksetConfiguration)
 Loads or reloads the Revit link. The link will be loaded from the location given in the input ExternalResourceReference.
LoadFrom(ModelPath, WorksetConfiguration)
 Loads or reloads the Revit link from disk. The link will be loaded from the input path.
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
Reload
 Loads or reloads the Revit link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
RevertLocalUnloadStatus
 Restores the workshared load status of a link that has been unloaded only for the current user, in a local copy of a workshared model.
SavePositions
 Saves shared coordinates changes back to the linked document.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unload
 Unloads the Revit link.
UnloadLocally
 Unloads a Revit link for the current user only.
UpdateFromIFC
 Updates a Revit link type from an IFC file and loads the linked document.
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace